In [4]:
import pandas as pd
import numpy as np

In [5]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [6]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [7]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=[2,5,3,7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [8]:
data[3]

0.75

In [9]:
np.zeros(3)

array([0., 0., 0.])

In [11]:
data = pd.Series([1, np.nan, 'hello', None])

In [12]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [13]:
print(data)

0        1
1      NaN
2    hello
3     None
dtype: object

In [14]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [15]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [16]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [17]:
data.dropna()

0        1
2    hello
dtype: object

In [18]:
df = pd.DataFrame([
    [1, np.nan, 2],
    [2, 3, 5],
    [np.nan, 4, 6]
])

In [19]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [20]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [21]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [23]:
df.dropna(axis=0)

     0    1  2
1  2.0  3.0  5

In [27]:
df.dropna(axis='rows', how = 'all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [29]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))

In [30]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [31]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64